app/controllers/campaigns_controller.rb

SELECT "campaigns".* FROM "campaigns"
---
	def index
		@campaigns = Campaign.all

SELECT  "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
	def show
		@campaign = Campaign.find(params[:id])