app/controllers/messages_controller.rb

INSERT INTO "messages" ("name", "email", "phone_number", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "asdfasd"], ["email", "sdfasdf"], ["phone_number", "sdfasdf"], ["message", "sdfasdf"], ["created_at", "2019-12-21 15:43:19.043354"], ["updated_at", "2019-12-21 15:43:19.043354"]]
---
	def create
		@message = Message.new(message_params)
		if @message.valid?
			@message.save