app/controllers/static_pages_controller.rb

SELECT "campaigns".* FROM "campaigns"
---
  def home
  	@campaigns = Campaign.all